Tekla.Structures.ModelInternal.RebarSetAddition
Defines a class that can be used to add LegFaces to a RebarSet.

Tekla.Structures.ModelInternal.RebarSetAddition.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarSetAddition class.
Initializes a new rebar set addition instance with empty attributes.

Tekla.Structures.ModelInternal.RebarSetAddition.Insert
Inserts the rebar set instance into the database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSetAddition.Modify
Modifies the RebarSet updating any add or remove operations.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSetAddition.Delete
Deletes the rebar set instance from the database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSetAddition.Select
Selects the rebar set instance from the database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSetAddition.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarSetAddition.ModifyInstance
The modify instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarSetAddition.SelectInstance
The select instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarSetAddition.ToStruct(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@)
The to struct.
p:
The p.

Tekla.Structures.ModelInternal.RebarSetAddition.FromStruct(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@)
The from struct.
p:
The p.

Tekla.Structures.ModelInternal.RebarSetAddition.LegFaces
Gets the rebar set's leg faces.

Tekla.Structures.ModelInternal.RebarSetAddition.Father
Gets or sets the RebarSet to which the object is added.